# FluidTemperature Properties

---
The FluidTemperature type exposes the following members.
| Name| Description
---|---|---
| Density|  The density value
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Temperature|  The temperature value
| Viscosity|  The dynamic viscosity value
Top
#### Reference
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace